[
	{
		"title": "Jeffrey Louie",
		"body": [
			"My parents never hid from me the fact that I was undocumented. I grew up knowing I was missing a number and some papers, but the reality of being undocumented—of how much you are silenced, limited, and turned away—didn’t come until much later.",
			"My family arrived in New York from Hong Kong in 1995 for better education prospects and other political reasons. I was just three and a half years old, so with the exception of our small apartment and the playground, I don’t remember much about Hong Kong. My parents had actually made an earlier trip in 1988 to visit my grandmother, who had immigrated to New York by herself and started working in Brooklyn’s garment factories. My brother was born a year after their visit, and is still the only member of the family who is a U.S. citizen. We are therefore a mixed status family, in which everyone’s immigration status differs.",
			"But my story after our arrival in the States doesn’t actually stray too far from everyone else’s. I went to elementary, middle, and high school in Brooklyn. I was the seventh grader who nearly beat all the eighth graders in the school spelling bee, the freshman everyone copied homework from. I participated in clubs, and volunteered at community organizations. I was a classmate, a neighbor, a best friend.",
			"And yet as an immigrant, my experiences have also been undeniably different. My choices for college were severely limited because of financial reasons and my ineligibility for financial aid. I felt helpless watching my father struggle to support our family because I could not look for jobs. I could not drive, and I could not travel. I was repeatedly told by strangers and peers, both intentionally and unintentionally, that I did not belong in America.",
			"I was recently asked if I had hope for comprehensive immigration reform and for the future. My answer a long time ago would have simply been “yes,” but my answer today is a much more pragmatic one—why only hope when you can also organize? I choose to share my story and participate with RAISE because that will mean more people understanding our parents’ sacrifices and the injustices our communities face. It will mean people becoming more aware of what is happening at our borders, and it will hopefully mean that families won’t have to be torn apart anymore. It will mean being able to decide for ourselves and our families what we want, and it will mean the raising of all of our voices in shaping this nation."
		],
		"email": "jeff@example.com",
		"image1": "/public/images/jeff_single.jpg",
		"image2": "/public/images/jeff_double.jpg",
		"stand_with_count": 15
	}
]