[
	{
		"title": "Hiding",
		"paragraphs": [
			"My parents never hid from me the fact that I was undocumented. I grew up knowing I was missing a number and some papers, but the reality of being undocumented—of how much you are silenced, limited, and turned away—didn’t come until much later.",
			"My family arrived in New York from Hong Kong in 1995 for better education prospects and other political reasons. I was just three and a half years old, so with the exception of our small apartment and the playground, I don’t remember much about Hong Kong. My parents had actually made an earlier trip in 1988 to visit my grandmother, who had immigrated to New York by herself and started working in Brooklyn’s garment factories. My brother was born a year after their visit, and is still the only member of the family who is a U.S. citizen. We are therefore a mixed status family, in which everyone’s immigration status differs.",
			"But my story after our arrival in the States doesn’t actually stray too far from everyone else’s. I went to elementary, middle, and high school in Brooklyn. I was the seventh grader who nearly beat all the eighth graders in the school spelling bee, the freshman everyone copied homework from. I participated in clubs, and volunteered at community organizations. I was a classmate, a neighbor, a best friend.",
			"And yet as an immigrant, my experiences have also been undeniably different. My choices for college were severely limited because of financial reasons and my ineligibility for financial aid. I felt helpless watching my father struggle to support our family because I could not look for jobs. I could not drive, and I could not travel. I was repeatedly told by strangers and peers, both intentionally and unintentionally, that I did not belong in America.",
			"I was recently asked if I had hope for comprehensive immigration reform and for the future. My answer a long time ago would have simply been “yes,” but my answer today is a much more pragmatic one—why only hope when you can also organize? I choose to share my story and participate with RAISE because that will mean more people understanding our parents’ sacrifices and the injustices our communities face. It will mean people becoming more aware of what is happening at our borders, and it will hopefully mean that families won’t have to be torn apart anymore. It will mean being able to decide for ourselves and our families what we want, and it will mean the raising of all of our voices in shaping this nation."
		],
		"email": "jeffrey@louie.com",
		"image1": "/images/jeff_left.jpg",
		"image2": "/images/jeff_right.jpg",
		"stand_with_count": 15
	},
	{
		"title": "Undocumented Activist",
		"paragraphs": [
			"When I moved here from the Philippines at the age of 15, it was one of the happiest moments of my life. It was a fresh start for my family considering what we had been through during the Asian economic crisis back in the late 90s. My siblings managed to become citizens but I could not. Their stories have happy endings. Mine doesn’t…yet.",
			"Not only am I undocumented, I am gay. People repeatedly told me I couldn’t marry the person I loved, and build a life with them in my own country. I’ve been told that I am someone who doesn’t belong, someone who must hide, and someone who remains unseen. I was “different” from my own family. I was isolated on every level. At first it seemed like the introduction of the new immigration bill was a ray of hope. But the bill puts me on a very long and uncertain 13-year path to citizenship. I’ve already spent nearly half my life waiting—and now pushing for a law that will humanely allow us to be citizens. But with this bill, I wonder how many of the millions of other undocumented immigrants and I will actually get to the end of that path.",
			"The bill also stops brothers or sisters who are citizens from sponsoring other siblings if they are married and over the age of 31. I’m 28 – not yet 31, but close. My family has already been scarred from being torn apart, and there is every reason to believe I might be torn apart from them again. I got tired of hearing I was a hopeless case. Last April, I went with RAISE to the national day of action for immigration reform in Washington DC. Hundreds of undocumented youth were there. As I looked out over the crowd of people, I realized that no matter how many times I am told I am a hopeless case, I am part of a bigger movement, one that extends beyond my own world.",
			"At this point, I have gone back to college. I hope to become a doctor, however long that hope has to be on hold. At the beginning of the summer, I announced on stage to hundreds during RAISE’s theater performance, #UndocuAsians, that I was undocumented. I had friends in the audience who I was coming out to for the first time. Finally, in June, the U.S Supreme Court struck down the Defense of Marriage Act (DOMA) and for the first time recognized gay marriage.",
			"I share my story now because I believe nothing—and no one—is a hopeless case. As much as I struggle to understand the proposed rules in Washington, and why they still fail to include so many people like my family and me, I also know that I will never give up. I won’t accept that now is not my time, too."
		],
		"email": "rhustie@valdizno.com",
		"image1": "/images/rhustie_left.jpg",
		"image2": "/images/rhustie_right.jpg",
		"stand_with_count": 20
	},
	{
		"title": "Injustice and Activism",
		"paragraphs": [
			"Now I understand why people form a human chain around their senator’s office, stage sit-ins in midst of traffic, and care about issues that don’t seemingly directly affect them. Prior to joining the movement for immigrants’ rights, I had conditioned myself to deal with life’s challenges reservedly, cautiously, and in a calculative manner. I stayed away from getting emotionally attached to any issue, whether personal or political.",
			"I have been undocumented since 2002, the year I left South Korea with my family after the late 90s financial crisis. My parents began working in a dry cleaning store (a “seh-tak-so”), where my mom was denied pay for at least a month under the excuse of “learning how to do the job.” That year, a lawyer who promised green cards for all of us turned out to be a scam and we were left undocumented. Without a social security number, I was utterly clueless when filling out college applications and financial aid forms, and I began harboring anger towards my parents. At the same time, I found it curious that my mother, who is still a co-owner of a business that hires more than a dozen Americans, was undocumented. Considering all of these circumstances, I felt compelled to advocate for change, but I seriously doubted that I, one of eleven million undocumented, would bring much of an impact on the movement for immigration reform.",
			"I began believing in raising my story shortly after Deferred Action for Childhood Arrivals (DACA) was announced last year. A fellow Korean American activist told me that DACA didn’t just happen – it was the result of DREAMers all across America tirelessly staging protests and writing petitions. I learned that battling the broken immigration system was much more complex and difficult than I had thought. The system, as I understand now, was partially born out of a long history of imperialism, oppression, and white supremacy that still pervades. For example, Chinese people were the first ethnic or racial group that the United States had explicitly denied entry into this country. When I went to the Asian Pacific Islander Grassroots for Social Justice conference in New Orleans last month, I became more and more aware of  how many current social issues are similarly influenced by this history.",
			"I can’t change what has happened, but I can recognize injustice and let others know about it and push for change, without thinking too selfishly about the “impact” or strategic value I can add to the movement. A fair and comprehensive immigration reform has not yet happened—and I continue to be critical of what politicians or even other immigration advocates define as “fair” or “comprehensive.” But I know that ultimately my greatest enemy is my own skepticism and indifference."
		],
		"email": "luke@hwang.com",
		"image1": "/images/luke_left.png",
		"image2": "/images/luke_right.png",
		"stand_with_count": 32
	},
	{
		"title": "Growing Up Without Parents",
		"paragraphs": [
			"I was 6 years old when my parents, facing financial difficulties, left me in China with my grandparents as they headed for America to make a better living and pay off their debts. Most nights, I asked my grandma the same question: “When will Mom and Dad come back?”. Every time, the response was silence. I always felt as if a large part of me was in America, with my parents. Overseas, both of my parents worked 12 hours a day, seven days of the week. My dad took the day shift as a truck driver while my mom took the night shift as a salesperson. A hefty amount of their monthly salary went into paying off debts; still, they managed to support me and my grandparents in China. All of their hard work was meant for me, so that I could grow up in a new environment with better opportunities. I was 11 when my parents finally had me join them in the U.S.",
			"In middle school, I struggled with my English and was constantly made fun of. Through those tough years, I befriended the Webster Dictionary and cartoon characters. Eventually, I decided that my dream was to work in the health field, so I wanted to dedicate my time and energy at my community hospital. It was then that I discovered my undocumented status: I was denied a volunteer position when I could not provide a social security number on the application form. In despair and afraid, I was convinced that the hospital would send someone after me.",
			"Senior year of high school came, along with college applications and the painful discovery that as an undocumented immigrant, I would be charged out-of-state tuition for all of the New York colleges I had applied to, despite the fact that I had lived here for nearly seven years. I felt hopeless and heartbroken. Fortunately, with the support of my family as well as my strong determination, I was able to overcome these initial obstacles. Now, life is headed towards the right direction, even though my choices are of course still limited. Still, I am so fortunate to currently be an applicant for Deferred Action for Childhood Arrivals (DACA).",
			"I am fortunate, too, to have discovered a group formed by other undocumented Asian American youth. Known as RAISE, this group serves as a safe place for undocumented youth, and to provide support and solutions regarding their status. I am raising my story for three reasons: first, I want to help show the country that undocumented youth, millions strong, have distinctly unique stories behind what can sometimes be a simplistic label. Second, I want to be a role model for my fellow undocumented youth who are in the shadows, to help lift them from the same despair that I once was in. Finally, I want to include my voice so that we can help to bring much-needed comprehensive immigration reform, so that families like mine can stay united in pursuit of their dreams and happiness."
		],
		"email": "henry@qin.com",
		"image1": "/images/henry_left.png",
		"image2": "/images/henry_right.png",
		"stand_with_count": 4
	},
	{
		"title": "Immigrant Reform",
		"paragraphs": [
			"When I came to New York at the age of seven, everything was different. Life was a struggle at first: my parents had to work in stressful, low paying jobs and we didn’t have much. In the beginning, I thought we were on a trip—-until the day my parents decided to enroll me at an elementary school. I grew up happily, having no idea that I was undocumented. Then, my high school years began. During that time, my high school began enrolling some students to take college classes. I was one of those students. I remember how the application asked for a social security number. I didn’t know whether I had one, until my older sibling informed me that, well, I didn’t. I found that I couldn’t do certain “normal” things that my other friends where doing, like travel. More importantly, I couldn’t go visit my grandparents.",
			"When it was time to apply for college, the idea of being undocumented began to hit hard. I still remember one of the first things I discussed with my school’s college advisor, which was how being undocumented will affect me in college. She mentioned that I won’t be eligible for financial aid, as most grants are given to citizens. I found that going away for college was impossible: tuition was too expensive, travel was out of the question, and so was financial aid. Therefore, I had to accept life at a 2-year college. Then came another blow from reality—-everyone began talking about applying for jobs. I remember going along with some friends to get job applications but when they asked for a social security number, I knew I wasn’t going to be able to get a job. Some friends sometimes question why I can’t do certain things, but it’s hard to tell someone else you’re undocumented because you fear they will judge you.",
			"It’s been a relief to have become a part of RAISE, where I have peers who are just like me and can understand the particular struggles of life as an undocumented immigrant. As of earlier this year, my DACA status has been approved, which means I can find work to help my family and fund my education. Till this day, it’s still hard to tell someone you’re undocumented, but it’s a little easier knowing there is a lot of other people who are just like me. This is why I’m sharing my story—-so that collectively, we can advance our greater cause: comprehensive immigration reform that keeps families united and strong so that individuals like me can achieve."
		],
		"email": "carmen@lam.com",
		"image1": "/images/carmen_left.png",
		"image2": "/images/carmen_right.png",
		"stand_with_count": 203
	},
	{
		"title": "Undocumented in America",
		"paragraphs": [
			"I came to the U.S. with my grandmother at the age of 15. Our family became separated, some sent back to South Korea and unable to return to America. I was living by myself at the age of 17. At the time, I thought a visa was just something you could always renew, like a passport.",
			"When it was time for college, I discovered my undocumented status, and it was devastating. Thankfully, I was able to go to college on a full private scholarship, but after graduating, my undocumented status made itself felt: I had no access to financial aid, no money to pay for graduate school, and no way to legally work. I nearly broke under the weight of my undocumented status. I lived in this invisible bubble, screaming inside: “Please, someone save me”.",
			"Currently, I am granted Deferred Action and have a work authorization. I am a member of RAISE and am working at MinKwon Center for Community Action as a youth program associate, all in an effort to organize young Asian Americans working for immigration reform. In the movement, I found my lost identity. The young, passionate, and brave kid is now back, as is a sense of hope: in the future, I hope to work as a research neuroscientist."
		],
		"email": "emily@park.com",
		"image1": "/images/emily_left.png",
		"image2": "/images/emily_right.png",
		"stand_with_count": 888
	}
]